import asyncio

from app.agent.data_analysis import DataAnalysis
from app.logger import logger

prefix = "帮我生成图表并保存到本地，具体包括："
tasks = [
    {
        "prompt": "帮我展示不同产品在不同地区的销售额",
        "data": """产品名称,地区,销售额
可口可乐,南方,2350
可口可乐,东方,1027
可口可乐,西方,1027
可口可乐,北方,1027
雪碧,南方,215
雪碧,东方,654
雪碧,西方,159
雪碧,北方,28
芬达,南方,345
芬达,东方,654
芬达,西方,2100
芬达,北方,1679
星木,南方,1476
星木,东方,830
星木,西方,532
星木,北方,498
""",
    },
    {
        "prompt": "展示各品牌的市场份额",
        "data": """品牌名称,市场份额,平均价格,净利润
苹果,0.5,7068,314531
三星,0.2,6059,362345
维沃,0.05,3406,234512
诺基亚,0.01,1064,-1345
小米,0.1,4087,131345""",
    },
    {
        "prompt": "请帮我展示各产品的销售趋势",
        "data": """日期,类型,数值
2023-01-01,产品A,52.9
2023-01-01,产品B,63.6
2023-01-01,产品C,11.2
2023-01-02,产品A,45.7
2023-01-02,产品B,89.1
2023-01-02,产品C,21.4
2023-01-03,产品A,67.2
2023-01-03,产品B,82.4
2023-01-03,产品C,31.7
2023-01-04,产品A,80.7
2023-01-04,产品B,55.1
2023-01-04,产品C,21.1
2023-01-05,产品A,65.6
2023-01-05,产品B,78
2023-01-05,产品C,31.3
2023-01-06,产品A,75.6
2023-01-06,产品B,89.1
2023-01-06,产品C,63.5
2023-01-07,产品A,67.3
2023-01-07,产品B,77.2
2023-01-07,产品C,43.7
2023-01-08,产品A,96.1
2023-01-08,产品B,97.6
2023-01-08,产品C,59.9
2023-01-09,产品A,96.1
2023-01-09,产品B,100.6
2023-01-09,产品C,66.8
2023-01-10,产品A,101.6
2023-01-10,产品B,108.3
2023-01-10,产品C,56.9""",
    },
    {
        "prompt": "展示搜索关键词的热度",
        "data": """关键词,热度
热词,1000
早了我们,800
饶建火,400
我的愿望是世界和平,400
秀秀秀,400
神舟十一号,400
百鸟朝凤,400
中国女排,400
我的关娜,400
腿东,400
火锅英雄,400
宝贝的心是苦的,400
奥运会,400
厉害了我的哥,400
诗和远方,400
宋仲基,400
PPAP,400
蓝瘦香菇,400
雨露均沾,400
友谊的小船说翻就翻,400
北京瘫,400
奉献,200
苹果,200
狗带,200
老司机,200
吃瓜群众,200
疯狂动物城,200
城会玩,200
套路,200
水逆,200
你怎么不上天,200
蛇精男,200
你怎么不上天,200
三星爆炸门,200
小李奥斯卡,200
丑人多读书,200
男友力,200
一脸懵逼,200
太阳的后裔,200""",
    },
    {
        "prompt": "帮我用散点图比较不同电动汽车品牌的性能",
        "data": """续航里程,充电时间,品牌名称,平均价格
2904,46,品牌1,2350
1231,146,品牌2,1027
5675,324,品牌3,1242
543,57,品牌4,6754
326,234,品牌5,215
1124,67,品牌6,654
3426,81,品牌7,159
2134,24,品牌8,28
1234,52,品牌9,345
2345,27,品牌10,654
526,145,品牌11,2100
234,93,品牌12,1679
567,94,品牌13,1476
789,45,品牌14,830
469,75,品牌15,532
5689,54,品牌16,498
""",
    },
    {
        "prompt": "展示每个流程的转化率",
        "data": """流程,转化率,月份
步骤1,100,1
步骤2,80,1
步骤3,60,1
步骤4,40,1""",
    },
    {
        "prompt": "展示男女早餐消费的差异",
        "data": """星期,男性早餐,女性早餐
周一,15,22
周二,12,10
周三,15,20
周四,10,12
周五,13,15
周六,10,15
周日,12,14""",
    },
    {
        "prompt": "帮我展示这个人在不同方面的表现，他是个六边形战士吗",
        "data": """维度,表现
力量,5
速度,5
投篮,3
耐力,5
精准,5
成长,5""",
    },
    {
        "prompt": "展示数据流",
        "data": """起点,终点,数值
节点A,节点1,10
节点A,节点2,5
节点B,节点2,8
节点B,节点3,2
节点C,节点2,4
节点A,节点C,2
节点C,节点1,2""",
    },
]


async def main():
    for index, item in enumerate(tasks):
        logger.info(f"开始任务 {index + 1} / {len(tasks)}!")
        agent = DataAnalysis()
        await agent.run(
            f"{prefix},chart_description:{item['prompt']},Data:{item['data']}"
        )
        logger.info(f"完成任务：{item['prompt']}")


if __name__ == "__main__":
    asyncio.run(main())
